---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderLegTooShortOrRunWidthTooGreatFailure
source: html/70d4d92e-7b63-821c-4a00-b903e2f1d4e9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderLegTooShortOrRunWidthTooGreatFailure Property

One leg of the winder run is too small or the runwidth is too great.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderLegTooShortOrRunWidthTooGreatFailure { get; }
```